{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/593b5968ca08.html"}],"tags":[],"categories":[],"pages":[{"title":"","text":"A simple, delicate, and modern theme for the static site generator Hexo. Preview | Documentation | Discuss on GitHub :cd: Installation12$ npm install hexo-theme-icarus$ hexo config theme icarus Please refer to Getting Started with Icarusfor more details. :gift: FeaturesCyberpunk Theme VariantTap into the future cyber world with the newly added Cyberpunk theme variant.Inspired by Cyberpunk 2077. Extensive Plugin SupportIcarus includes plentiful search, comment, sharing and other plugins out of the box that makes yourblog feature-rich and powerful. Comment Changyan &amp;middot; Disqus &amp;middot; DisqusJS &amp;middot; Facebook &amp;middot; Gitalk &amp;middot; Gitment &amp;middot;Isso &amp;middot; LiveRe &amp;middot; Utterance &amp;middot; Valine Donate Button Afdian.net &amp;middot; Alipay &amp;middot; Buy me a coffee &amp;middot; Patreon &amp;middot; Paypal &amp;middot; Wecat Search Algolia &amp;middot; Baidu &amp;middot; Google CSE &amp;middot; Insight Share AddThis &amp;middot; AddToAny &amp;middot; Baidu Share &amp;middot; Share.js &amp;middot; ShareThis Widgets Google Adsense &amp;middot; Archives &amp;middot; Categories &amp;middot; External Site Links &amp;middot;Recent Posts &amp;middot; Google Feedburner &amp;middot; Tags &amp;middot; Table of Contents Analytics Baidu Statistics &amp;middot; Bing Webmaster &amp;middot; BuSuanZi Web Counter &amp;middot; CNZZ Statistics &amp;middot;Google Analytics &amp;middot; Hotjar &amp;middot; StatCounter &amp;middot; Twitter Conversion Tracking Other Plugins Cookie Consent &amp;middot; LightGallery &amp;middot; Justified Gallery &amp;middot; KaTeX &amp;middot; MathJax &amp;middot;Oudated Browser &amp;middot; Page Loading Animations Colorful Code HighlightIcarus directly import stylesheets from the highlight.js package and makes more than90 code highlight themes available to you. Atom One Light Monokai Kimbie Dark Flexible Theme ConfigurationIcarus allows you to configure your site on a per-page or per-layout basis. _config.icarus.yml12345widgets: - type: profile position: left - type: recent_posts position: right post.md12345widgets: - type: profile position: left - type: recent_posts position: left _config.page.yml1widgets: null Responsive LayoutGive your audiences best viewing experience with Icarus’s mobile-friendly responsive layout. :hammer: DevelopmentThis project is built with Hexo Inferno.js Stylus Bulma Please refer to the documentation andcontributing guide for implementation details. :tada: ContributeIf you feel like to help us build a better Icarus, you can :black_nib: Submit a tutorial |:earth_asia: Add a translation |:triangular_flag_on_post: Report a bug |:electric_plug: Suggest a new feature :memo: LicenseThis project is licensed under the MIT License - see the LICENSE file for details.","link":"/about/index.html"}]}